       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TABLE.
          05 WS-ITEM PIC 9(2) OCCURS 3 TIMES.
       01 WS-I PIC 9 VALUE 4.
       PROCEDURE DIVISION.
           MOVE 7 TO WS-ITEM(WS-I).
           DISPLAY WS-ITEM(1).
           STOP RUN.
