       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC 9(3) VALUE 5.
       PROCEDURE DIVISION.
           DISPLY WS-X.
           STOP RUN.
