       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TOTAL PIC 9(3) VALUE 10.
       PROCEDURE DIVISION.
           DISPLAY WS-TOTL.
           STOP RUN.
