       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME PIC X(20).
       PROCEDURE DIVISION.
           ACCEPT WS-NAME.
           DISPLAY "Hello, " FUNCTION TRIM(WS-NAME) "!".
           STOP RUN.
